; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v11 ?v12)
             (pred_7 ?v5 ?v3)
             (pred_3 ?v11 ?v3)
             (pred_8 ?v9 ?v11 )
	     (pred_5 ?v11)
             (pred_12 ?v2)
             (pred_4 ?v5)
             (pred_11 ?v3)
             (pred_1 ?v11)
             (pred_10 ?v5)
             (pred_6 ?v11)
             (pred_2 ))



(:action op_4
:parameters (?v6 ?v8 ?v1 ?v7)
:precondition (and (pred_12 ?v6) (pred_12 ?v8) (pred_4 ?v1) (pred_11 ?v7)
          (pred_9 ?v6 ?v8) (pred_7 ?v1 ?v7)
                   (pred_3 ?v8 ?v7) (pred_5 ?v6) 
                   (pred_1 ?v8) (pred_10 ?v1))
:effect (and  (pred_6 ?v8) (not (pred_1 ?v8))))


(:action op_1
:parameters (?v6 ?v13)
:precondition (and (pred_12 ?v6) (pred_12 ?v13)
               (pred_5 ?v6) (pred_9 ?v6 ?v13) (pred_6 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v6))))

(:action op_3
:parameters (?v6 ?v1)
:precondition (and (pred_12 ?v6) (pred_4 ?v1) 
                  (pred_5 ?v6) (pred_8 ?v1 ?v6) (pred_2 ))
:effect (and (pred_10 ?v1)
   (not (pred_8 ?v1 ?v6)) (not (pred_2 ))))


(:action op_5
:parameters (?v6 ?v10 ?v4)
:precondition (and (pred_12 ?v6) (pred_4 ?v10) (pred_4 ?v4)
                  (pred_5 ?v6) (pred_10 ?v4) (pred_8 ?v10 ?v6))
:effect (and (pred_10 ?v10) (pred_8 ?v4 ?v6)
        (not (pred_10 ?v4)) (not (pred_8 ?v10 ?v6))))

(:action op_2
:parameters (?v6 ?v1)
:precondition (and (pred_12 ?v6) (pred_4 ?v1) 
                  (pred_5 ?v6) (pred_10 ?v1))
:effect (and (pred_2 ) (pred_8 ?v1 ?v6) (not (pred_10 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_14 obj_04 obj_08 obj_07 obj_18 obj_12 obj_10 obj_06 obj_03 obj_02 obj_01 obj_21 obj_20 obj_11 obj_15
    obj_19 obj_09
    obj_16 obj_13 obj_17
    )

    (:init
       (pred_2)

       (pred_12 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_02)
       (pred_12 obj_01)
       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_17)

       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_18)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_18 obj_07)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_12 obj_18)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_20 obj_11)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_20)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_15 obj_11)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_21)
       (pred_3  obj_08 obj_19)
       (pred_3  obj_04 obj_09)
       (pred_3  obj_21 obj_09)
       (pred_6 obj_05)
       (pred_6 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_10)
       (pred_6 obj_06)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_01)
       (pred_6 obj_20)
       (pred_6 obj_11)
       (pred_6 obj_15)

       (pred_7  obj_16 obj_19)
       (pred_7  obj_13 obj_09)
       (pred_7  obj_17 obj_09)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_17 obj_02)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_8 obj_16 obj_02)
       (pred_8 obj_13 obj_01)
    ))
(:constraints
  (always (not (pred_5 obj_03)))
)
)

; plan
1. (op_1 obj_01 obj_15)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_15)
   goals met: 0 of 2
2. (op_3 obj_15 obj_16)
   deleted: (pred_8 obj_16 obj_15) (pred_2)
   added: (pred_10 obj_16)
   goals met: 0 of 2
3. (op_1 obj_15 obj_01)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_01)
   goals met: 0 of 2
4. (op_1 obj_01 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_02)
   goals met: 0 of 2
5. (op_5 obj_02 obj_17 obj_16)
   deleted: (pred_10 obj_16) (pred_8 obj_17 obj_02)
   added: (pred_10 obj_17) (pred_8 obj_16 obj_02)
   goals met: 1 of 2
6. (op_1 obj_02 obj_11)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_11)
   goals met: 1 of 2
7. (op_1 obj_11 obj_20)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_20)
   goals met: 1 of 2
8. (op_4 obj_20 obj_21 obj_17 obj_09)
   deleted: (pred_1 obj_21)
   added: (pred_6 obj_21)
   goals met: 1 of 2
9. (op_1 obj_20 obj_21)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_21)
   goals met: 1 of 2
10. (op_1 obj_21 obj_06)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_06)
   goals met: 1 of 2
11. (op_5 obj_06 obj_13 obj_17)
   deleted: (pred_10 obj_17) (pred_8 obj_13 obj_06)
   added: (pred_10 obj_13) (pred_8 obj_17 obj_06)
   goals met: 1 of 2
12. (op_1 obj_06 obj_07)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_07)
   goals met: 1 of 2
13. (op_1 obj_07 obj_18)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_18)
   goals met: 1 of 2
14. (op_1 obj_18 obj_12)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_12)
   goals met: 1 of 2
15. (op_1 obj_12 obj_10)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_10)
   goals met: 1 of 2
16. (op_1 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 1 of 2
17. (op_2 obj_01 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_2) (pred_8 obj_13 obj_01)
   goals met: 2 of 2
